
## Plan Result




<pre><code>Plan: 8 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.api_gw_s2s_secret
  * azurerm_key_vault_secret.servicebus_primary_connection_string
  * azurerm_key_vault_secret.servicebus_primary_shared_access_key
  * module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace
  * module.servicebus-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule
  * module.servicebus-sdt-queue.azurerm_servicebus_queue.servicebus_queue
  * module.servicebus-sdt-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule
  * module.servicebus-sdt-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.api_gw_s2s_secret will be created
  + resource "azurerm_key_vault_secret" "api_gw_s2s_secret" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-shared-aat/providers/Microsoft.KeyVault/vaults/civil-shared-aat"
      + name           = "api-gateway-s2s-secret"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.servicebus_primary_connection_string will be created
  + resource "azurerm_key_vault_secret" "servicebus_primary_connection_string" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-shared-aat/providers/Microsoft.KeyVault/vaults/civil-shared-aat"
      + name           = "civil-sdt-servicebus-connection-string"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # azurerm_key_vault_secret.servicebus_primary_shared_access_key will be created
  + resource "azurerm_key_vault_secret" "servicebus_primary_shared_access_key" {
      + id             = (known after apply)
      + key_vault_id   = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/civil-shared-aat/providers/Microsoft.KeyVault/vaults/civil-shared-aat"
      + name           = "civil-sdt-servicebus-shared-access-key"
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace.servicebus_namespace will be created
  + resource "azurerm_servicebus_namespace" "servicebus_namespace" {
      + capacity                            = 1
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + id                                  = (known after apply)
      + local_auth_enabled                  = true
      + location                            = "uksouth"
      + name                                = "civil-servicebus-aat"
      + resource_group_name                 = "civil-shared-aat"
      + sku                                 = "Premium"
      + tags                                = {
          + "BuiltFrom"           = "https://github.com/HMCTS/civil-sdt.git"
          + "Destroy Me"          = "No"
          + "Team Contact"        = "#civil-sdt"
          + "application"         = "civil"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#civil_contact"
          + "environment"         = "staging"
          + "managedBy"           = "Civil"
        }
      + zone_redundant                      = true
    }

  # module.servicebus-namespace.azurerm_servicebus_namespace_authorization_rule.send_listen_auth_rule will be created
  + resource "azurerm_servicebus_namespace_authorization_rule" "send_listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "SendAndListenSharedAccessKey"
      + namespace_id                      = (known after apply)
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

  # module.servicebus-sdt-queue.data.azurerm_servicebus_namespace.this will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_servicebus_namespace" "this"  {
      + capacity                            = (known after apply)
      + default_primary_connection_string   = (sensitive value)
      + default_primary_key                 = (sensitive value)
      + default_secondary_connection_string = (sensitive value)
      + default_secondary_key               = (sensitive value)
      + id                                  = (known after apply)
      + location                            = (known after apply)
      + name                                = "civil-servicebus-aat"
      + resource_group_name                 = "civil-shared-aat"
      + sku                                 = (known after apply)
      + tags                                = (known after apply)
      + zone_redundant                      = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.servicebus-sdt-queue.azurerm_servicebus_queue.servicebus_queue will be created
  + resource "azurerm_servicebus_queue" "servicebus_queue" {
      + auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S"
      + dead_lettering_on_message_expiration    = true
      + default_message_ttl                     = "P10675199DT2H48M5.4775807S"
      + duplicate_detection_history_time_window = "PT10M"
      + enable_batched_operations               = true
      + enable_express                          = false
      + enable_partitioning                     = false
      + id                                      = (known after apply)
      + lock_duration                           = "PT1M"
      + max_delivery_count                      = 10
      + max_message_size_in_kilobytes           = (known after apply)
      + max_size_in_megabytes                   = 1024
      + name                                    = "civil-sdt-in-out-aat"
      + namespace_id                            = (known after apply)
      + requires_duplicate_detection            = false
      + requires_session                        = false
      + status                                  = "Active"
    }

  # module.servicebus-sdt-queue.azurerm_servicebus_queue_authorization_rule.listen_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "listen_auth_rule" {
      + id                                = (known after apply)
      + listen                            = true
      + manage                            = false
      + name                              = "ListenSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = false
    }

  # module.servicebus-sdt-queue.azurerm_servicebus_queue_authorization_rule.send_auth_rule will be created
  + resource "azurerm_servicebus_queue_authorization_rule" "send_auth_rule" {
      + id                                = (known after apply)
      + listen                            = false
      + manage                            = false
      + name                              = "SendSharedAccessKey"
      + primary_connection_string         = (sensitive value)
      + primary_connection_string_alias   = (sensitive value)
      + primary_key                       = (sensitive value)
      + queue_id                          = (known after apply)
      + secondary_connection_string       = (sensitive value)
      + secondary_connection_string_alias = (sensitive value)
      + secondary_key                     = (sensitive value)
      + send                              = true
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":124,"Program":"tfcmt","SHA1":"","Vars":{}} -->